In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
s1 = pd.Series([23,55,7,8,10])

In [4]:
s1

0    23
1    55
2     7
3     8
4    10
dtype: int64

In [5]:
s1.values

array([23, 55,  7,  8, 10], dtype=int64)

In [6]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
s2 = pd.Series([23, 55, 7, 8, 10], index = ['A', 'B', 'C', 'D', 'E'])

In [8]:
s2

A    23
B    55
C     7
D     8
E    10
dtype: int64

In [9]:
s2[s2>20]

A    23
B    55
dtype: int64

In [10]:
s2[s2>=10]

A    23
B    55
E    10
dtype: int64

In [11]:
s2[0]

23

In [13]:
s2[0]

23

In [14]:
s2['A']

23

In [15]:
s2["A"] = 100

In [16]:
s2

A    100
B     55
C      7
D      8
E     10
dtype: int64

In [25]:
dados = {'Ano':[2014,2015,2016,2017, 2018, 2019], 
        'País':['EUA', 'China', 'Brazil', 'Canada', 'Portugal', 'Espanha'],
        'Vendas':[50, 60, 70, 40, 10, 88]}

In [26]:
df = pd.DataFrame(dados)

In [27]:
df

    Ano      País  Vendas
0  2014       EUA      50
1  2015     China      60
2  2016    Brazil      70
3  2017    Canada      40
4  2018  Portugal      10
5  2019   Espanha      88

In [28]:
df["País"]

0         EUA
1       China
2      Brazil
3      Canada
4    Portugal
5     Espanha
Name: País, dtype: object

In [29]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [30]:
df[:2]

    Ano   País  Vendas
0  2014    EUA      50
1  2015  China      60

In [31]:
df.head()

    Ano      País  Vendas
0  2014       EUA      50
1  2015     China      60
2  2016    Brazil      70
3  2017    Canada      40
4  2018  Portugal      10

In [32]:
df.tail()

    Ano      País  Vendas
1  2015     China      60
2  2016    Brazil      70
3  2017    Canada      40
4  2018  Portugal      10
5  2019   Espanha      88

In [36]:
df2 = pd.DataFrame(dados, columns = ['Ano', 'País', 'Vendas', 'Valores'], index=['a','b','c','d', 'e','f'])

In [37]:
df2

    Ano      País  Vendas Valores
a  2014       EUA      50     NaN
b  2015     China      60     NaN
c  2016    Brazil      70     NaN
d  2017    Canada      40     NaN
e  2018  Portugal      10     NaN
f  2019   Espanha      88     NaN

In [38]:
df2['Valores'] = np.random.rand(6)*100

In [39]:
df2

    Ano      País  Vendas    Valores
a  2014       EUA      50  86.965252
b  2015     China      60  92.026098
c  2016    Brazil      70  95.134435
d  2017    Canada      40  93.605946
e  2018  Portugal      10  35.441907
f  2019   Espanha      88   2.659797

In [40]:
df.describe()

               Ano     Vendas
count     6.000000   6.000000
mean   2016.500000  53.000000
std       1.870829  26.795522
min    2014.000000  10.000000
25%    2015.250000  42.500000
50%    2016.500000  55.000000
75%    2017.750000  67.500000
max    2019.000000  88.000000

In [41]:
df2["a":"d"]

    Ano    País  Vendas    Valores
a  2014     EUA      50  86.965252
b  2015   China      60  92.026098
c  2016  Brazil      70  95.134435
d  2017  Canada      40  93.605946

In [42]:
df2.loc['d']

Ano             2017
País          Canada
Vendas            40
Valores    93.605946
Name: d, dtype: object